In [1]:
import pandas as pd

In [3]:
movies = pd.read_csv('movies.csv')
movies.head()

   Rank                         Title       Studio       Gross  Year
0     1             Avengers: Endgame  Buena Vista  $2,796.30   2019
1     2                        Avatar          Fox  $2,789.70   2009
2     3                       Titanic    Paramount  $2,187.50   1997
3     4  Star Wars: The Force Awakens  Buena Vista  $2,068.20   2015
4     5        Avengers: Infinity War  Buena Vista  $2,048.40   2018

In [4]:
# 흠.. 데이터를 보니 왼쪽부터 순위, 이름, 제작사, 총수익, 년도가 되겠군요!

In [8]:
# 가장 왼쪽의 0, 1, 2, 3, 4 보이나요? 이 부분을 인덱스라고 하는데 별다른 지침을 주지 않으면 0부터 순서대로 인덱스를 생성합니다.
# 그래서 우리는 이 인덱스를 바꿔줄꺼에요! 영화 이름을 기준으로요!
movies = pd.read_csv('movies.csv', index_col='Title')
movies.head()

                              Rank       Studio       Gross  Year
Title
Avengers: Endgame                1  Buena Vista  $2,796.30   2019
Avatar                           2          Fox  $2,789.70   2009
Titanic                          3    Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015
Avengers: Infinity War           5  Buena Vista  $2,048.40   2018

In [10]:
# 지금까지는 head 함수를 사용해서 데이터프레임의 일부분을 보았습니다.
# 사용자 아무것도 적지 않았을 때, n의 값은 기본 5입니다.
movies.head(n=5)

                              Rank       Studio       Gross  Year
Title
Avengers: Endgame                1  Buena Vista  $2,796.30   2019
Avatar                           2          Fox  $2,789.70   2009
Titanic                          3    Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015
Avengers: Infinity War           5  Buena Vista  $2,048.40   2018

In [11]:
# 머리의 반대는 꼬리겠죠?
movies.tail(n=5)

                          Rank           Studio     Gross  Year
Title
Yogi Bear                  778  Warner Brothers  $201.60   2010
Garfield: The Movie        779              Fox  $200.80   2004
Cats & Dogs                780  Warner Brothers  $200.70   2001
The Hunt for Red October   781        Paramount  $200.50   1990
Valkyrie                   782              MGM  $200.30   2008

In [13]:
# 이번에는 총 몇개의 데이터가 있는지 볼까요?
print('데이터의 총 행의 개수 : {}'.format(len(movies)))

데이터의 총 행의 개수 : 782

In [14]:
# shape함수를 통해서도 볼 수 있습니다.
movies.shape

(782, 4)

In [15]:
# 782, 4에서 앞에있는건 행이라고 했고, 뒤에있는건 열입니다. Rank, Studio, Gross, Year 총 4개 맞죠?

In [16]:
# 총 셀의 개수도 셀 수 있습니다. 셀의 개수는 행 x 열의 개수입니다.
print('총 셀의 개수 : {}'.format(movies.size))

총 셀의 개수 : 3128

In [17]:
# 각 행이 어떤 타입인지를 알 수도 있습니다.
movies.dtypes

Rank       int64
Studio    object
Gross     object
Year       int64
dtype: object

In [20]:
# 판다스에서 제일 중요한 두 함수가 있는데 iloc함수와 loc함수 입니다.
# 비슷하게 생겨서 그런지, 꽤나 비슷한 역할을 합니다.
# 이 둘의 제일 중요한 차이점은 loc는 인덱스의 이름, iloc는 절대위치라는 겁니다.
# 만약 우리가 5번째 행의 값들을 구하고 싶다면 iloc[4]를 구해야할까요? 아니면 loc[4]를 구해야할까요?
try:
    print(movies.iloc[4])
except KeyError:
    print('keyerror가 발생하였습니다.')

Rank                5
Studio    Buena Vista
Gross      $2,048.40
Year             2018
Name: Avengers: Infinity War, dtype: object

In [21]:
# 흠, iloc[4]는 문제가 없군요.
# 이번에는 loc[4]를 해보죠.
try:
    print(movies.loc[4])
except KeyError:
    print('keyerror가 발생하였습니다.')

keyerror가 발생하였습니다.

In [23]:
# 어? keyerror가 발생하는군요!
# 왜 keyerror가 발생할까요? 제가 앞에서 설명했듯 loc는 인덱스의 이름, iloc는 절대위치라고 했습니다.
# iloc[4]는 0부터 시작해서 끝행인 781번째 행 중에서 4번째인(사실 5번째) 값을 추출한다는 의미이지만,
# loc[4]의 경우 인덱스 이름 중 4인 행이 있나요? 모두 영화이름으로 되어있는데 4라고 적으면 올바른 결과가 도출될까요?
# 따라서, 우리는 loc를 적을때는 반드시 인덱스 이름을 적는다는 것을 기억해야합니다.
movies.loc['Avengers: Infinity War']

Rank                5
Studio    Buena Vista
Gross      $2,048.40
Year             2018
Name: Avengers: Infinity War, dtype: object

In [25]:
# 만약, 연도 순서대로 데이터 프레임을 정렬하고 싶다면 어떻게 해야할까요?
movies.sort_values(by='Year').head()

                    Rank       Studio     Gross  Year
Title
Gone with the Wind   288          MGM  $402.40   1939
Bambi                540          RKO  $267.40   1942
101 Dalmatians       708  Buena Vista  $215.90   1961
The Jungle Book      755  Buena Vista  $205.80   1967
The Godfather        604    Paramount  $245.10   1972

In [33]:
# 최근 영화부터 정렬하고 싶다면 ascending=False로 두면 됩니다!
movies.sort_values(by='Year', ascending=False).head()

,Rank,Studio,Gross,Year
Title,,,,
Avengers: Endgame,1,Buena Vista,"$2,796.30",2019
John Wick: Chapter 3 - Parabellum,458,Lionsgate,$304.70,2019
The Wandering Earth,114,China Film Corporation,$699.80,2019
Toy Story 4,198,Buena Vista,$519.80,2019
How to Train Your Dragon: The Hidden World,199,Universal,$519.80,2019

In [34]:
# 하지만, Studio가 중복되는 경우가 있겠죠? 이럴때는 by의 값을 여러개 할당하면 됩니다.
movies.sort_values(by=['Studio', 'Year']).head()

                         Rank       Studio     Gross  Year
Title
The Blair Witch Project   588      Artisan  $248.60   1999
101 Dalmatians            708  Buena Vista  $215.90   1961
The Jungle Book           755  Buena Vista  $205.80   1967
Who Framed Roger Rabbit   410  Buena Vista  $329.80   1988
Dead Poets Society        636  Buena Vista  $235.90   1989

In [30]:
# 근데, sort를 쳐보면 sort_values와 sort_index가 나오지 않나요?
# sort_values는 특정 열을 기준으로 정렬을 하는 것이고, sort_index는 index를 기준으로 정렬한다는 의미입니다.
movies.sort_index().head()

                  Rank           Studio     Gross  Year
Title
10,000 B.C.        536  Warner Brothers  $269.80   2008
101 Dalmatians     708      Buena Vista  $215.90   1961
101 Dalmatians     425      Buena Vista  $320.70   1996
2 Fast 2 Furious   632        Universal  $236.40   2003
2012                93             Sony  $769.70   2009

In [36]:
# 만약, 수익률을 가장 많이 낸 영화를 가장 많이 만든 제작사는 어디일까요?
movies['Studio'].value_counts().head()

Studio
Warner Brothers    132
Buena Vista        125
Fox                117
Universal          109
Sony                86
Name: count, dtype: int64

In [39]:
# 만약 Universal에서 만든 영화만 찾고 싶다면 어떻게 해야할까요?
movies[movies['Studio']=='Universal'].head()

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015

In [50]:
# Universal에서 제작하고, Year의 값이 2015년인 경우를 찾으려면
# 이렇게 괄호를 사용해서 각각의 조건을 묶으면 됩니다.
movies[(movies['Studio']=='Universal') & (movies['Year']==2015)].head()

                      Rank     Studio       Gross  Year
Title
Jurassic World           6  Universal  $1,671.70   2015
Furious 7                8  Universal  $1,516.00   2015
Minions                 19  Universal  $1,159.40   2015
Fifty Shades of Grey   165  Universal    $571.00   2015
Pitch Perfect 2        504  Universal    $287.50   2015

In [49]:
# 만약의 조건이 또는 이라면, |를 사용하면 되겠죠?
movies[(movies['Studio']=='Universal') | (movies['Year']==2015)].head()

                                Rank       Studio       Gross  Year
Title
Star Wars: The Force Awakens       4  Buena Vista  $2,068.20   2015
Jurassic World                     6    Universal  $1,671.70   2015
Furious 7                          8    Universal  $1,516.00   2015
Avengers: Age of Ultron            9  Buena Vista  $1,405.40   2015
Jurassic World: Fallen Kingdom    13    Universal  $1,309.50   2018

In [53]:
# 예를 들어, 1975년 이전에 개봉한 영화도 찾을 수 있죠.
movies[movies['Year'] < 1975].head()

                    Rank           Studio     Gross  Year
Title
The Exorcist         252  Warner Brothers  $441.30   1973
Gone with the Wind   288              MGM  $402.40   1939
Bambi                540              RKO  $267.40   1942
The Godfather        604        Paramount  $245.10   1972
101 Dalmatians       708      Buena Vista  $215.90   1961

In [56]:
# 그리고 특정 값 사이에, 1983년부터 1986년 사이에 개봉한 영화도 가져올 수 있죠.
movies[movies['Year'].between(1983, 1986)].head()

                                      Rank     Studio     Gross  Year
Title
Return of the Jedi                     222        Fox  $475.10   1983
Back to the Future                     311  Universal  $381.10   1985
Top Gun                                357  Paramount  $356.80   1986
Indiana Jones and the Temple of Doom   403  Paramount  $333.10   1984
Crocodile Dundee                       413  Paramount  $328.20   1986

In [58]:
# 이번에는 인덱스에 특정 문자를 포함한 값들을 찾아볼까요? dark라는 문자를 담고 있는 값을 찾아봅시다.
movies[movies.index.str.lower().str.contains('dark')].head()

                                Rank           Studio       Gross  Year
Title
Transformers: Dark of the Moon    23        Paramount  $1,123.80   2011
The Dark Knight Rises             27  Warner Brothers  $1,084.90   2012
The Dark Knight                   39  Warner Brothers  $1,004.90   2008
Thor: The Dark World             132      Buena Vista    $644.60   2013
Star Trek Into Darkness          232        Paramount    $467.40   2013

In [68]:
# 이번에는 Gross를 숫자로 바꿔보죠.
# 복잡한 정규 표현식을 사용하다가 오류가 발생할 수 있는 경우, regex=False를 사용하면 오류 발생 가능성을 줄일 수 있습니다.
# astype은 전체 속성을 소수 형태로 바꿉니다.
movies['Gross'].str.replace('$', '', regex=False).str.replace(',', '', regex=False).astype(float)

Title
Avengers: Endgame               2796.3
Avatar                          2789.7
Titanic                         2187.5
Star Wars: The Force Awakens    2068.2
Avengers: Infinity War          2048.4
                                 ...
Yogi Bear                        201.6
Garfield: The Movie              200.8
Cats & Dogs                      200.7
The Hunt for Red October         200.5
Valkyrie                         200.3
Name: Gross, Length: 782, dtype: float64

In [69]:
# 영구적으로 해당 데이터프레임의 값을 바꾸고 싶다면 변수를 대입해야겠죠?
movies['Gross'] = movies['Gross'].str.replace('$', '', regex=False).str.replace(',', '', regex=False).astype(float)

In [71]:
# 평균 흥행 수익을 계산할 수도 있습니다.
movies['Gross'].mean()

np.float64(439.0308184143222)

In [76]:
# groupby를 사용해서 특정 열을 중심으로 그룹화를 시킬 수 있습니다.
movies.groupby('Studio').count()['Gross'].sort_values(ascending=False).head()

Studio
Warner Brothers    132
Buena Vista        125
Fox                117
Universal          109
Sony                86
Name: Gross, dtype: int64

In [79]:
# 그리고 각 제작사가 벌어들인 수익도 계산할 수 있습니다.
movies.groupby('Studio').sum()['Gross'].sort_values(ascending=False).head()

Studio
Buena Vista        73585.0
Warner Brothers    58643.8
Fox                50420.8
Universal          44302.3
Sony               32822.5
Name: Gross, dtype: float64

In [81]:
# 가장 많은 수익을 벌어들인 곳은 Buena Vista네요!!
# 이번엔 평균수익을 볼까요?
movies.groupby('Studio').mean()['Gross'].sort_values(ascending=False).head()

Studio
HC                        870.300000
China Film Corporation    699.800000
Newmarket                 611.900000
Buena Vista               588.680000
Lionsgate                 477.771429
Name: Gross, dtype: float64

In [82]:
# 평균 수익이 가장 높은 곳은 HC인것 같네요. Buena Vista가 총 수익률은 높지만, 평균이 낮은 이유는 성공하는 영화는 성공하고, 실패하는 영화는 완전히 실패하는 모양이군요!